mst/modules/abc/controllers/base/AuthController.php

SELECT `prefix` FROM `abc_partner` WHERE `id`=100
---
	public function beforeAction($action)
	{

		if (!parent::beforeAction($action)) {
			return false;
		}

		//return true;

		if (Yii::$app->user->isGuest) {
			throw new \yii\web\UnauthorizedHttpException("对不起，您现在还没登录");
		}


		$module_name = Yii::$app->controller->module->id;
		$pid = Yii::$app->user->identity->partner_id;
		$prefix = Partner::find()->select('prefix')->where(['id' => $pid])->scalar();