common/models/form/UserLogin.php

SELECT * FROM `abc_User` WHERE (`username`='admin') AND (`status`=1)
---
	public function getUser()
	{
		if ($this->_user === false) {
			$this->_user = User::findOne([
				'username' => $this->username,
				'status' => User::STATUS_ENABLE,
			]);

SELECT `u`.* FROM `abc_User` `u` LEFT JOIN `abc_partner` `p` ON `p`.`id`=u.partner_id WHERE (`u`.`token`='123') AND (`u`.`status`=1) AND (`p`.`prefix`='abc')
---
	public function getUserByToken($token)
	{
		$host = Yii::$app->request->hostInfo;
		list($scheme, $domain) = explode('://', $host);
		$arr = explode('.', $domain);
		if (count($arr) != 4) {
			return null;
		}
		$prefix = $arr[0];

		if ($this->_user === false) {
			$this->_user = User::find()
				->alias('u')
				->leftJoin(['p' => Partner::tableName()], ['p.id' => new Expression('u.partner_id')])
				->where([
					'u.token' => $token,
					'u.status' => User::STATUS_ENABLE,
					'p.prefix' => $prefix,
				])
				->one();