mst/controllers/UserController.php

	public function actionLogin() {
		$model = new UserLogin();
		if ($model->load(Yii::$app->request->post())) {
			if ($model->login()) {
				Message::setSuccessMsg('登录成功');
				$token = Yii::$app->user->identity->token;
				$pid = Yii::$app->user->identity->partner_id;
				$prefix = Partner::find()->select(['prefix'])->where(['id'=>$pid])->scalar();
---
SELECT `prefix` FROM `abc_partner` WHERE `id`=100