common/models/table/abc/User.php

SELECT * FROM `abc_User` WHERE `id`=1
---
    public static function findIdentity($id) {
		return self::findOne(['id' => $id]);